{
    "setName": "Adventures at Hogwarts",
    "releaseDate": "06-2002",
    "totalCards": "80",
    "cards": [
        {
            "number": "1",
            "name": "Albus Dumbledore",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Wizard",
                "Unique"
            ],
            "flavorText": "'(Order of Merlin, First Class, Grand Sorc., Chf. Warlock, Supreme Mugwump, International Confed. of Wizards)' — Hogwarts letterhead",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "If you have at least 4 Lessons in play, your Spell cards with a printed Power cost of 6 or more need 2 less Power to play. (You still need at least 1 Power that matches.)"
            ]
        },
        {
            "number": "2",
            "name": "Argus Filch",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Unique"
            ],
            "flavorText": "'Filch knew the secret passageways of the school better than anyone... and could pop up as suddenly as any of the ghosts.'",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "You may use an Action to discard an Adventure from play (yours or your opponent's). (You don't get the reward.)"
            ]
        },
        {
            "number": "3",
            "name": "Crabbe and Goyle",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Wizard",
                "Slytherin",
                "Unique"
            ],
            "flavorText": "'Both of them were thickest and looked extremely mean.'",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "You may use an Action and discard 2 cards from your hand to do 3 damage to your opponent."
            ]
        },
        {
            "number": "4",
            "name": "Detention!",
            "type": [
                "Adventure"
            ],
            "rarity": "Foil Premium",
            "artist": "Scott M. Fischer",
            "effect": [
                "Your opponent can't use Actions to play Adventure cards.",
                "to solve: Your opponent chooses 2 Adventure cards in his or her hand and discards them.",
                "reward: Your opponent may draw a card."
            ],
            "toSolve": "Your opponent chooses 2 Adventure cards in his or her hand and discards them.",
            "reward": "Your opponent may draw a card."
        },
        {
            "number": "5",
            "name": "Dragon's Blood",
            "lesson": [
                "Potions"
            ],
            "cost": "7",
            "type": [
                "Spell"
            ],
            "flavorText": "'... Professor Dumbledore is particularly famous for... the discovery of the twelve uses of dragon's blood...' — Chocolate Frog card",
            "rarity": "Foil Premium",
            "artist": "Tim Hildebrandt",
            "effect": [
                "To play this card, discard 2 of your Potions Lessons from play. Do 11 damage to your opponent or to a Creature of your choice."
            ]
        },
        {
            "number": "6",
            "name": "Dumbledore's Watch",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "9",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Unique"
            ],
            "rarity": "Foil Premium",
            "artist": "Jeff Laubenstein",
            "effect": [
                "If this card is in play before your turn, discard all cards (other than each player's starting Character) from play (including this card)."
            ]
        },
        {
            "number": "7",
            "name": "End-of-Year Feast",
            "lesson": [
                "Charms"
            ],
            "cost": "4",
            "type": [
                "Spell"
            ],
            "flavorText": "'... the huge Slytherin serpent vanished and a towering Gryffindor lion took its place.'",
            "rarity": "Foil Premium",
            "artist": "James Bernardin",
            "effect": [
                "Put up to 4 Adventure cards from your discard pile into your hand."
            ]
        },
        {
            "number": "8",
            "name": "Fang",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "8",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Dog",
                "Unique"
            ],
            "dmgEachTurn": "4",
            "health": "7",
            "flavorText": "'Like Hagrid, Fang was clearly not as fierce as he looked.'",
            "rarity": "Foil Premium",
            "artist": "Monte Michael Moore",
            "effect": [
                "To play this card, discard 1 of your Care of Magical Creatures Lessons from play. When you play this card, do 4 damage to your opponent."
            ]
        },
        {
            "number": "9",
            "name": "Finding the Platform",
            "type": [
                "Adventure"
            ],
            "rarity": "Foil Premium",
            "artist": "Jeff Laubenstein",
            "effect": [
                "Your opponent can't use Actions to play Location cards.",
                "to solve: Your opponent lets you search your deck. You may take up to 2 Location cards from your deck, show them to your opponent and put them into your hand. Then shuffle your deck.",
                "reward: Your opponent may put a Lesson card from his or her hand into play."
            ],
            "toSolve": "Your opponent lets you search your deck. You may take up to 2 Location cards from your deck, show them to your opponent and put them into your hand. Then shuffle your deck.",
            "reward": "Your opponent may put a Lesson card from his or her hand into play."
        },
        {
            "number": "10",
            "name": "Galleon",
            "lesson": [
                "Charms"
            ],
            "cost": "10",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Money"
            ],
            "rarity": "Foil Premium",
            "artist": "Romas",
            "effect": [
                "You can play only 1 Money card each turn. Before your turn, if this card is in play, discard it and your get 3 more Actions this turn."
            ]
        },
        {
            "number": "11",
            "name": "Great Hall",
            "lesson": [
                "Charms"
            ],
            "cost": "2",
            "type": [
                "Location"
            ],
            "subTypes": [
                "Unique"
            ],
            "note": "When you play this card, discard any other Location from play (yours or your opponent's).",
            "flavorText": "'It was lit by thousands and thousands of candles which were floating in midair over four long tables, ...'",
            "rarity": "Foil Premium",
            "artist": "James Bernardin",
            "effect": [
                "Before each player's turn, he or she draws a card."
            ]
        },
        {
            "number": "12",
            "name": "Hagrid's House",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "3",
            "type": [
                "Location"
            ],
            "subTypes": [
                "Unique"
            ],
            "note": "When you play this card, discard any other Location from play (yours or your opponent's).",
            "flavorText": "'Hagrid lived in a small wooden house on the edge of the Forbidden Forest.'",
            "rarity": "Foil Premium",
            "artist": "Jim Nelson",
            "effect": [
                "Whenever a Care of Magical Creatures Lesson (yours or your opponent's) is discarded from play, put it into its owner's hand."
            ]
        },
        {
            "number": "13",
            "name": "Harry Triumphant",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Unique",
                "Wizard",
                "Seeker",
                "Gryffindor"
            ],
            "flavorText": "'... to Mr Harry Potter ...' ... '... for pure nerve and outstanding courage, I award Gryffindor house sixty points.' — Albus Dumbledore",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "At the end of each of your turns, if you played an Adventure card that turn, draw up to 4 cards."
            ]
        },
        {
            "number": "14",
            "name": "Hospital Dormitory",
            "lesson": [
                "Potions"
            ],
            "cost": "7",
            "type": [
                "Location"
            ],
            "note": "When you play this card, discard any other Location from play (yours or your opponent's).",
            "flavorText": "'He realised he must be in the hospital wing.'",
            "rarity": "Foil Premium",
            "artist": "Kevin Dobler",
            "effect": [
                "Each turn, each player may prevent 4 damage done to him or her. (The damage may be prevented from one or more cards.)"
            ]
        },
        {
            "number": "15",
            "name": "Hut on the Rock",
            "type": [
                "Adventure"
            ],
            "note": "Play this card only if you have at least 5 Lessons in play.",
            "rarity": "Foil Premium",
            "artist": "Ron Spencer",
            "effect": [
                "Before each of your opponent's turns, if he or she has any cards in play (other than his or her starting Character), he or she chooses 1 of them and discards it.",
                "to solve: Your opponent discards his or her hand.",
                "reward: You take 5 damage."
            ],
            "toSolve": "Your opponent discards his or her hand.",
            "reward": "You take 5 damage."
        },
        {
            "number": "16",
            "name": "Madam Pomfrey",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Unique",
                "Witch",
                "Healing"
            ],
            "flavorText": "'Madam Pomfrey, the matron, was a nice woman, but very strict.'",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "Once per game, you may shuffle up to 12 non-Healing cards from your discard pile into your deck."
            ]
        },
        {
            "number": "17",
            "name": "Meeting Fluffy",
            "type": [
                "Adventure"
            ],
            "note": "Play this card only if you have at least 9 Lessons in play.",
            "rarity": "Foil Premium",
            "artist": "Kevin Dobler",
            "effect": [
                "Before each of your turns, your opponent takes 12 damage.",
                "to solve: Your opponent lets you choose 3 of his or her cards in play (other than his or her starting Character) and discard them.",
                "reward: Your opponent gets 1 more Action the turn he or she solves this Adventure."
            ],
            "toSolve": "Your opponent lets you choose 3 of his or her cards in play (other than his or her starting Character) and discard them.",
            "reward": "Your opponent gets 1 more Action the turn he or she solves this Adventure."
        },
        {
            "number": "18",
            "name": "Midnight Duel",
            "type": [
                "Adventure"
            ],
            "note": "Play this card only if you have at least 5 Lessons in play.",
            "rarity": "Foil Premium",
            "artist": "Ken Steacy",
            "effect": [
                "To use an Action to play a Creature or a Spell card from his or her hand, your opponent must discard another card from his or her hand.",
                "to solve: Your opponent chooses 4 of his or her cards in play (other than his or her starting Character) and discards them.",
                "reward: Your opponent may draw 4 cards."
            ],
            "toSolve": "Your opponent chooses 4 of his or her cards in play (other than his or her starting Character) and discards them.",
            "reward": "Your opponent may draw 4 cards."
        },
        {
            "number": "19",
            "name": "Mirror of Erised",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "10",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Unique"
            ],
            "rarity": "Foil Premium",
            "artist": "Scott M. Fischer",
            "effect": [
                "You may use an Action to discard this card from play. If you do, count the number of cards in your hand and discard them. Then search your deck. You may take up to that number of cards from your deck and put them into your hand. Then shuffle your deck."
            ]
        },
        {
            "number": "20",
            "name": "Peeves",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Ghost",
                "Unique"
            ],
            "flavorText": "'... Peeves the poltergeist was worth two locked doors and a trick staircase if you met him when you were late for class.'",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "Once per game, you may discard your hands and draw 7 cards to make your opponent discard his or her hand and then draw 7 cards."
            ]
        },
        {
            "number": "21",
            "name": "Philosopher's Stone",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "15",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Healing",
                "Unique"
            ],
            "rarity": "Foil Premium",
            "artist": "Monte Michael Moore",
            "effect": [
                "You may use 2 Actions to discard this card from play to put all Lesson cards from your discard pile into play. Then shuffle all non-Healing cards from your discard pile into your deck. When you build your deck, you can only put 1 Philosopher's Stone in it."
            ]
        },
        {
            "number": "22",
            "name": "Potions Dungeon",
            "lesson": [
                "Potions"
            ],
            "cost": "3",
            "type": [
                "Location"
            ],
            "subTypes": [
                "Unique"
            ],
            "note": "When you play this card, discard any other Location from play (yours or your opponent's).",
            "flavorText": "'It... would have been quite creepy enough without the pickled animals floating in glass jars all around the walls.'",
            "rarity": "Foil Premium",
            "artist": "Tim Hildebrandt",
            "effect": [
                "Whenever a Potions Lesson (yours or your opponent's) is discarded from play, put it into its owner's hand."
            ]
        },
        {
            "number": "23",
            "name": "Quidditch Cup",
            "lesson": [
                "Quidditch"
            ],
            "cost": "9",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Unique"
            ],
            "rarity": "Foil Premium",
            "artist": "Darrell Riche",
            "effect": [
                "Once during each of your turns, when you use an Action to play a card that needs Quidditch Power, you get 1 more Action that turn."
            ]
        },
        {
            "number": "24",
            "name": "Quidditch Pitch",
            "lesson": [
                "Quidditch"
            ],
            "cost": "2",
            "type": [
                "Location"
            ],
            "note": "When you play this card, discard any other Location from play (yours or your opponent's).",
            "flavorText": "'At either end of the pitch were three golden poles with hoops at the end.'",
            "rarity": "Foil Premium",
            "artist": "Darrell Riche",
            "effect": [
                "Spell cards that need Quidditch Power (yours and your opponent's) need 2 less Power to play (you still need at least 1 Power that matches)."
            ]
        },
        {
            "number": "25",
            "name": "Riding the Centaur",
            "type": [
                "Adventure"
            ],
            "rarity": "Foil Premium",
            "artist": "Ken Steacy",
            "effect": [
                "Prevent all damage done to you by your opponent's Creatures.",
                "to solve: Your opponent chooses 4 of his or her cards in play (other than his or her starting Character) and returns them to his or her hand.",
                "reward: Your opponent may draw a card."
            ],
            "toSolve": "Your opponent chooses 4 of his or her cards in play (other than his or her starting Character) and returns them to his or her hand.",
            "reward": "Your opponent may draw a card."
        },
        {
            "number": "26",
            "name": "Ron the Brave",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Unique",
                "Wizard",
                "Gryffindor"
            ],
            "flavorText": "'... you don't think we'd let you go alone?' - Ron Weasley",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "At the end of each of your turns, if you played an Adventure card that turn, your may search your deck. You may take a Character card from your deck, show it to your opponent and put it into your hand. Then shuffle your deck."
            ]
        },
        {
            "number": "27",
            "name": "Stoat Sandwiches",
            "type": [
                "Adventure"
            ],
            "rarity": "Foil Premium",
            "artist": "Ken Steacy",
            "effect": [
                "Your opponent can't use Actions to play Healing cards.",
                "to solve: Your opponent chooses 5 of his or her cards in play (other than his or her starting Character) and discards them.",
                "reward: Your opponent may shuffle up to 5 non-Healing cards from his or her discard pile into his or her deck."
            ],
            "toSolve": "Your opponent chooses 5 of his or her cards in play (other than his or her starting Character) and discards them.",
            "reward": "Your opponent may shuffle up to 5 non-Healing cards from his or her discard pile into his or her deck."
        },
        {
            "number": "28",
            "name": "The Fat Lady",
            "type": [
                "Character"
            ],
            "subTypes": [
                "Unique",
                "Gryffindor"
            ],
            "flavorText": "'At the very end of the corridor hung a portrait of a very fat woman in a pink silk dress. 'Password?', she said.'",
            "rarity": "Holo Portrait Premium",
            "artist": "Kim Graham",
            "effect": [
                "You may use an Action to search your deck. You may take a Gryffindor card from your deck, show it to your opponent and put it into your hand. Then shuffle your deck."
            ]
        },
        {
            "number": "29",
            "name": "Voldemort Revealed",
            "type": [
                "Adventure"
            ],
            "rarity": "Foil Premium",
            "artist": "Scott M. Fischer",
            "effect": [
                "Your opponent can't use Actions to play Spell cards.",
                "to solve: Your opponent takes 7 damage.",
                "reward: Your opponent may put up to 2 non-Healing cards from his or her discard pile and put them on the bottom of his deck (in any order)."
            ],
            "toSolve": "Your opponent takes 7 damage.",
            "reward": "Your opponent may put up to 2 non-Healing cards from his or her discard pile and put them on the bottom of his deck (in any order)."
        },
        {
            "number": "30",
            "name": "Welsh Green Dragon",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "7",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Dragon"
            ],
            "flavorText": "'... you can't tame dragons, it's dangerous.' - Ron Weasley",
            "dmgEachTurn": "6",
            "health": "4",
            "rarity": "Foil Premium",
            "artist": "Lars Grant-West",
            "effect": [
                "To play this card, discard 2 of your Care of Magical Creatures Lessons from play. When you play this card, do 6 damage to your opponent."
            ]
        },
        {
            "number": "31",
            "name": "5 Points from Gryffindor",
            "type": [
                "Adventure"
            ],
            "note": "Play this card only if you have at least 5 Lessons in play.",
            "rarity": "Uncommon",
            "artist": "Scott M. Fischer",
            "effect": [
                "Your opponent gets 1 fewer Action on each of his or her turns (even the turn this Adventure is solved). (If this would mean your opponent would have fewer than 1 Action, he or she still gets 1 Action.)",
                "to solve: Your opponent chooses 5 cards from his or her hand and discards them.",
                "reward: You take 5 damage."
            ],
            "toSolve": "Your opponent chooses 5 cards from his or her hand and discards them.",
            "reward": "You take 5 damage."
        },
        {
            "number": "32",
            "name": "Alohomora",
            "lesson": [
                "Charms"
            ],
            "cost": "4",
            "type": [
                "Spell"
            ],
            "flavorText": "'She grabbed Harry's wand, tapped the lock and whispered, 'Alohomora!''",
            "rarity": "Uncommon",
            "artist": "Bob Petillo",
            "effect": [
                "Search your deck. You may take a Location of Adventure card from your deck, show it to your opponent and put it into your hand. Then shuffle your deck."
            ]
        },
        {
            "number": "33",
            "name": "Baneberry Potion",
            "lesson": [
                "Potions"
            ],
            "cost": "3",
            "type": [
                "Spell"
            ],
            "rarity": "Uncommon",
            "artist": "Thomas Gianni",
            "effect": [
                "To play this card, discard 2 of your Potions Lessons from play. Do 8 damage to your opponent or to a Creature of your choice."
            ]
        },
        {
            "number": "34",
            "name": "Bludger Bop",
            "lesson": [
                "Quidditch"
            ],
            "cost": "6",
            "type": [
                "Spell"
            ],
            "flavorText": "'... OUCH - that must have hurt, hit in the back of the head by a Bludger  - ...'  - Lee Jordan, commentator",
            "rarity": "Uncommon",
            "artist": [
                "Kevin McCann",
                "Michael Collins"
            ],
            "effect": [
                "Your opponent chooses 1 of his or her cards in play (other than his or her starting Character) and discards it. Then, if he or she has any cards in his or her hand, he or she chooses 1 of them and discards it."
            ]
        },
        {
            "number": "35",
            "name": "Candy Cart",
            "type": [
                "Adventure"
            ],
            "note": "Play this card only if you have at least 3 Lessons in play.",
            "rarity": "Uncommon",
            "artist": "Michael Koelsch",
            "effect": [
                "Before each of your opponent's turns, he or she draws 3 cards and then chooses 3 cards in his or her hand and discards them.",
                "to solve: Your opponent takes 10 damage.",
                "reward: Your opponent may draw a card."
            ],
            "toSolve": "Your opponent takes 10 damage.",
            "reward": "Your opponent may draw a card."
        },
        {
            "number": "36",
            "name": "Collapsible Cauldron",
            "lesson": [
                "Potions"
            ],
            "cost": "6",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Cauldron"
            ],
            "provides": [
                {
                    "lesson": "Potions",
                    "amount": "3"
                }
            ],
            "rarity": "Uncommon",
            "artist": "George Davis",
            "effect": [
                "To play this card, discard 1 of your Potions Lessons from play. If this card is discarded from play, put it into your hand."
            ]
        },
        {
            "number": "37",
            "name": "Flying Motorbike",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "3",
            "type": [
                "Spell"
            ],
            "flavorText": "'... with a roar it rose into the air and off into the night.'",
            "rarity": "Uncommon",
            "artist": "Scott M. Fischer",
            "effect": [
                "Choose an Adventure or Location in play and discard it. (If you discard an Adventure, you don't get the reward.)"
            ]
        },
        {
            "number": "38",
            "name": "Flying Practice",
            "type": [
                "Adventure"
            ],
            "rarity": "Uncommon",
            "artist": "Darrell Riche",
            "effect": [
                "Spell cards that need Quidditch Power use up 2 of your opponent's Actions instead of 1.",
                "to solve: Your opponent discards 4 cards that need Quidditch Power from his or her hand.",
                "reward: You take 2 damage."
            ],
            "toSolve": "Your opponent discards 4 cards that need Quidditch Power from his or her hand.",
            "reward": "You take 2 damage."
        },
        {
            "number": "39",
            "name": "Forbidden Corridor",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "6",
            "type": [
                "Location"
            ],
            "subTypes": [
                "Unique"
            ],
            "note": "When you play this card, discard any other Location from play (yours or your opponent's).",
            "flavorText": "'And now they know why it was forbidden.'",
            "rarity": "Uncommon",
            "artist": "Doug Chaffee",
            "effect": [
                "Before each player's turn, he or she chooses 1 of his or her cards in play (other than his or her starting Character) and discards it. At the end of each player's turn, if he or she has no Lessons in play, discard this card."
            ]
        },
        {
            "number": "40",
            "name": "Giant Squid",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "10",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Squid"
            ],
            "dmgEachTurn": "5",
            "health": "10",
            "rarity": "Uncommon",
            "artist": "Jeff Laubenstein"
        },
        {
            "number": "41",
            "name": "Looking for Trevor",
            "type": [
                "Adventure"
            ],
            "rarity": "Uncommon",
            "artist": "David Day",
            "effect": [
                "Your opponent can't use Actions to play Creature cards.",
                "to solve: Your opponent chooses 2 of his or her Lessons in play and discards them.",
                "reward: Your opponent may search his or her deck. He or she may take a Creature card, show it to you, and put it into his or her hand. Then your opponent shuffles his or her deck."
            ],
            "toSolve": "Your opponent chooses 2 of his or her Lessons in play and discards them.",
            "reward": "Your opponent may search his or her deck. He or she may take a Creature card, show it to you, and put it into his or her hand. Then your opponent shuffles his or her deck."
        },
        {
            "number": "42",
            "name": "Marble Gargoyle",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "5",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Gargoyle"
            ],
            "dmgEachTurn": "2",
            "health": "3",
            "flavorText": "'Gulpin' gargoyles ...' - Rubeus Hagrid",
            "rarity": "Uncommon",
            "artist": "Tony Szczudlo",
            "effect": [
                "When Marble Gargoyle does damage to your opponent, if he or she doesn't have any Creatures in play, it does 3 more damage to him or her."
            ]
        },
        {
            "number": "43",
            "name": "Muddy Practice",
            "lesson": [
                "Quidditch"
            ],
            "cost": "1",
            "type": [
                "Match"
            ],
            "note": "Either player may use an Action to discard a card from his or her hand.",
            "rarity": "Uncommon",
            "artist": "Ken Steacy",
            "effect": [
                "to win: Discard 5 cards from your hand in this way.",
                "prize: The winner does 10 damage to his or her opponent."
            ],
            "toWin": "Discard 5 cards from your hand in this way.",
            "prize": "The winner does 10 damage to his or her opponent."
        },
        {
            "number": "44",
            "name": "Purple Firecrackers",
            "lesson": [
                "Charms"
            ],
            "cost": "6",
            "type": [
                "Spell"
            ],
            "flavorText": "'It took several purple firecrackers exploding from the end of Professor Dumbledore's wand to bring silence.'",
            "rarity": "Uncommon",
            "artist": "Greg Hildebrandt",
            "effect": [
                "Your opponent chooses 3 cards in his or her hand and discards them. (If he or she has fewer than 3 cards in his or her hand, he or she discards them all.)"
            ]
        },
        {
            "number": "45",
            "name": "Running from Filch",
            "type": [
                "Adventure"
            ],
            "note": "Play this card only if you have at least 6 Lessons in play.",
            "rarity": "Uncommon",
            "artist": "Monte Michael Moore",
            "effect": [
                "Your opponent can't use Actions to play Lesson cards.",
                "to solve: Your opponent discards his or her hand.",
                "reward: Your opponent may draw 3 cards."
            ],
            "toSolve": "Your opponent discards his or her hand.",
            "reward": "Your opponent may draw 3 cards."
        },
        {
            "number": "46",
            "name": "Sickle",
            "lesson": [
                "Charms"
            ],
            "cost": "7",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Money"
            ],
            "rarity": "Uncommon",
            "artist": "Thomas Gianni",
            "effect": [
                "You can play only 1 Money card each turn. Before your turn, if this card is in play, discard it and your get 2 more Actions this turn."
            ]
        },
        {
            "number": "47",
            "name": "Star Grass Salve",
            "lesson": [
                "Potions"
            ],
            "cost": "8",
            "type": [
                "Spell"
            ],
            "subTypes": [
                "Healing"
            ],
            "rarity": "Uncommon",
            "artist": "Bob Petillo",
            "effect": [
                "To play this card, discard one of your Potions Lessons from play. Shuffle up to 12 non-Healing cards from your discard pile into your deck."
            ]
        },
        {
            "number": "48",
            "name": "Through the Trapdoor",
            "type": [
                "Adventure"
            ],
            "rarity": "Uncommon",
            "artist": "Ken Steacy",
            "effect": [
                "Your opponent discards the card drawn at the start of each of his or her turns.",
                "to solve: The card drawn and discarded at the start of your opponent's turn is a Lesson card.",
                "reward: You take 1 damage."
            ],
            "toSolve": "The card drawn and discarded at the start of your opponent's turn is a Lesson card.",
            "reward": "You take 1 damage."
        },
        {
            "number": "49",
            "name": "Winter Holiday",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "9",
            "type": [
                "Spell"
            ],
            "flavorText": "'... Hogwarts woke to find itself covered in several feet of snow.'",
            "rarity": "Uncommon",
            "artist": "Doug Chaffee",
            "effect": [
                "Your opponent chooses 3 of his or her Lessons in play and discards them. Then you choose 3 of your Lessons in play and discard them. (If either of you has fewer than 3 Lessons in play, that player discards them all.)"
            ]
        },
        {
            "number": "50",
            "name": "Wooden Flute",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "8",
            "type": [
                "Spell"
            ],
            "flavorText": "'... it sounded a bit like an owl.'",
            "rarity": "Uncommon",
            "artist": "Tony Szczudlo",
            "effect": [
                "Choose up to 3 Creatures in play and return them to their owner's hands."
            ]
        },
        {
            "number": "51",
            "name": "Anti-Cheating Spell",
            "lesson": [
                "Charms"
            ],
            "cost": "3",
            "type": [
                "Spell"
            ],
            "flavorText": "'They had been given special, new quills for the exams, which had been bewitched with an Anti-Cheating spell.'",
            "rarity": "Common",
            "artist": "Greg Hildebrandt",
            "effect": [
                "Look at your opponent's hand. If there are any Lessons there, choose 1 of them and discard it."
            ]
        },
        {
            "number": "52",
            "name": "Bewitched Snowballs",
            "lesson": [
                "Charms"
            ],
            "cost": "5",
            "type": [
                "Spell"
            ],
            "flavorText": "'... the Weasley twins were punished for bewitching several snowballs so that they followed Quirrell around, bouncing off the back of his turban.'",
            "rarity": "Common",
            "artist": "Alex Horley",
            "effect": [
                "Do 3 damage to your opponent or to a Creature of your choice. Then draw a card."
            ]
        },
        {
            "number": "53",
            "name": "Black Bat",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "4",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Bat"
            ],
            "dmgEachTurn": "2",
            "health": "1",
            "rarity": "Common",
            "artist": "George Davis",
            "effect": [
                "When you play this card, do 2 damage to your opponent."
            ]
        },
        {
            "number": "54",
            "name": "Bucking Broomstick",
            "lesson": [
                "Quidditch"
            ],
            "cost": "7",
            "type": [
                "Spell"
            ],
            "flavorText": "'It was as though the broom was trying to buck him off.'",
            "rarity": "Common",
            "artist": "Darrell Riche",
            "effect": [
                "Do 3 damage to your opponent. Then, if your opponent has any cards in his or her hand, he or she chooses 2 of them and discards them (1 if he or she only has 1)."
            ]
        },
        {
            "number": "55",
            "name": "Cauldron Cakes",
            "lesson": [
                "Potions"
            ],
            "cost": "1",
            "type": [
                "Spell"
            ],
            "subTypes": [
                "Healing",
                "Candy"
            ],
            "flavorText": "'He had never had any money for sweets with the Dursleys ...'",
            "rarity": "Common",
            "artist": "Monte Michael Moore",
            "effect": [
                "Choose up to 2 non-Healing cards from your discard pile and put them on the bottom of your deck (in any order). Then draw a card. (Cauldron Cakes isn't really a Cauldron.)"
            ]
        },
        {
            "number": "56",
            "name": "Charms Accident",
            "lesson": [
                "Charms"
            ],
            "cost": "2",
            "type": [
                "Spell"
            ],
            "flavorText": "'Seamus got so impatient that he prodded it with his wand and set fire to it - ...'",
            "rarity": "Common",
            "artist": "Keith Garletts",
            "effect": [
                "Do 2 damage to your opponent. You may also choose a non-Healing Item in play and return it to its owner's hand."
            ]
        },
        {
            "number": "57",
            "name": "Chimaera",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "7",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Chimaera"
            ],
            "dmgEachTurn": "4",
            "health": "2",
            "rarity": "Common",
            "artist": "Jim Nelson"
        },
        {
            "number": "58",
            "name": "Dog Bite",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "4",
            "type": [
                "Spell"
            ],
            "flavorText": "''Blasted thing,' Snape was saying. 'How are you supposed to keep your eyes on all three heads at once?''",
            "rarity": "Common",
            "artist": "Scott M. Fischer",
            "effect": [
                "Choose a Creature in play. That Creature does damage to your opponent equal to that Creature's printed 'Damage each turn.'"
            ]
        },
        {
            "number": "59",
            "name": "Every-Flavour Beans",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "1",
            "type": [
                "Spell"
            ],
            "subTypes": [
                "Candy"
            ],
            "flavorText": "'When they say every flavour, they mean every flavour - ...'  - Ron Weasley",
            "rarity": "Common",
            "artist": "Cindy Salans Rosenheim",
            "effect": [
                "Reveal the top 2 card of your deck. Put into play any Lesson cards you revealed. Put into your discard pile any non-Lesson cards you revealed. Then draw a card."
            ]
        },
        {
            "number": "60",
            "name": "Fire Protection Potion",
            "lesson": [
                "Potions"
            ],
            "cost": "3",
            "type": [
                "Spell"
            ],
            "flavorText": "'He ... saw the black flames licking his body but couldn't feel them - ...'",
            "rarity": "Common",
            "artist": "Scott M. Fischer",
            "effect": [
                "Do 3 damage to your opponent. During your opponent's next turn, prevent all damage done to you by Spell cards."
            ]
        },
        {
            "number": "61",
            "name": "Fungiface Potion",
            "lesson": [
                "Potions"
            ],
            "cost": "4",
            "type": [
                "Spell"
            ],
            "rarity": "Common",
            "artist": "Alex Horley",
            "effect": [
                "To play this card, discard 1 of your Potions Lessons from play. Do 6 damage to your opponent or to a Creature of your choice."
            ]
        },
        {
            "number": "62",
            "name": "Knut",
            "lesson": [
                "Charms"
            ],
            "cost": "1",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Money"
            ],
            "rarity": "Common",
            "artist": "Tony Szczudlo",
            "effect": [
                "You can play only 1 Money card each turn. Before your turn, if this card is in play, discard it and you get 1 more Action this turn."
            ]
        },
        {
            "number": "63",
            "name": "Liquorice Wand",
            "lesson": [
                "Charms"
            ],
            "cost": "1",
            "type": [
                "Spell"
            ],
            "subTypes": [
                "Candy"
            ],
            "rarity": "Common",
            "artist": "Bob Petillo",
            "effect": [
                "Do 2 damage to your opponent. Then draw a card. (Liquorice Wand isn't really a Wand.)"
            ]
        },
        {
            "number": "64",
            "name": "Loop-the-Loops",
            "lesson": [
                "Quidditch"
            ],
            "cost": "8",
            "type": [
                "Spell"
            ],
            "flavorText": "'When Angelina had scored, Harry had done a couple loop-the-loops to let out his feelings.'",
            "rarity": "Common",
            "artist": "Ken Steacy",
            "effect": [
                "Do 4 damage to your opponent. Then draw 4 cards."
            ]
        },
        {
            "number": "65",
            "name": "Manegro Potion",
            "lesson": [
                "Potions"
            ],
            "cost": "6",
            "type": [
                "Spell"
            ],
            "rarity": "Common",
            "artist": "Kevin Dobler",
            "effect": [
                "Count the number of Potions Lessons you have in play. Do that much damage to your opponent. Then choose 1 of your Potions Lessons in play and discard it."
            ]
        },
        {
            "number": "66",
            "name": "Muffling Draught",
            "lesson": [
                "Potions"
            ],
            "cost": "3",
            "type": [
                "Spell"
            ],
            "rarity": "Common",
            "artist": "James Bernardin",
            "effect": [
                "During your opponent's next turn, he or she can't use Actions to play Spell cards."
            ]
        },
        {
            "number": "67",
            "name": "Owl Post",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "6",
            "type": [
                "Spell"
            ],
            "flavorText": "'... about a hundred owls had suddenly streamed into the Great Hall ...'",
            "rarity": "Common",
            "artist": "James Bernardin",
            "effect": [
                "Draw 3 cards."
            ]
        },
        {
            "number": "68",
            "name": "Photo Album",
            "lesson": [
                "Charms"
            ],
            "cost": "5",
            "type": [
                "Item"
            ],
            "flavorText": "'Smiling and waving at him from every page were his mother and father.'",
            "rarity": "Common",
            "artist": "Romas",
            "effect": [
                "Before each of your turns, draw a card."
            ]
        },
        {
            "number": "69",
            "name": "Sandstone Gargoyle",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "3",
            "type": [
                "Creature"
            ],
            "subTypes": [
                "Gargoyle"
            ],
            "dmgEachTurn": "1",
            "health": "2",
            "flavorText": "'It was sitting as still as a statue...'",
            "rarity": "Common",
            "artist": "Tony Szczudlo",
            "effect": [
                "When Sandstone Gargoyle does damage to your opponent, if he or she doesn't have any Creatures in play, it does 2 more damage to him or her."
            ]
        },
        {
            "number": "70",
            "name": "School Broom",
            "lesson": [
                "Quidditch"
            ],
            "cost": "4",
            "type": [
                "Item"
            ],
            "subTypes": [
                "Broom"
            ],
            "rarity": "Common",
            "artist": "Thomas Gianni",
            "effect": [
                "When you play this card, draw a card. If you play this card, and you already have a Broom in play, discard the old one."
            ]
        },
        {
            "number": "71",
            "name": "Scribblifors",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "7",
            "type": [
                "Spell"
            ],
            "rarity": "Common",
            "artist": "Mark Romanoski",
            "effect": [
                "Choose 2 of your opponent's cards in play (other than his or her starting Character). Your opponent discards one of them and returns the other to his or her hand."
            ]
        },
        {
            "number": "72",
            "name": "Sleeping Potion",
            "lesson": [
                "Potions"
            ],
            "cost": "4",
            "type": [
                "Spell"
            ],
            "rarity": "Common",
            "artist": "Kevin Dobler",
            "effect": [
                "Do 4 damage to your opponent. During your opponent's next turn, he or she can't use Actions to play Adventure cards."
            ]
        },
        {
            "number": "73",
            "name": "Switching Spell",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "4",
            "type": [
                "Spell"
            ],
            "flavorText": "'... you'll lose all the points I got from Professor McGonagall for knowing about Switching Spells.' - Hermione Granger",
            "rarity": "Common",
            "artist": "Ken Steacy",
            "effect": [
                "Choose an Item in play (yours or your opponent's) and discard it. Then search your deck. You may take an Item card from your deck, show it to your opponent and put it into your hand. Then shuffle your deck."
            ]
        },
        {
            "number": "74",
            "name": "Troll Bogies",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "cost": "3",
            "type": [
                "Spell"
            ],
            "flavorText": "'He bent down and pulled his wand out of the troll's nose. It was covered in what looked like lumpy grey glue. 'Urgh - troll bogies.''",
            "rarity": "Common",
            "artist": "Greg Hildebrandt",
            "effect": [
                "Choose a non-Healing Item in play and return it to its owner's hand."
            ]
        },
        {
            "number": "75",
            "name": "Vanishing Step",
            "lesson": [
                "Transfiguration"
            ],
            "cost": "1",
            "type": [
                "Spell"
            ],
            "flavorText": "'There were ... some with a vanishing step halfway up that you had to remember to jump.'",
            "rarity": "Common",
            "artist": "Alex Horley",
            "effect": [
                "During your opponent's next turn, he or she gets 1 fewer Action. (If this would mean your opponent has fewer than 1 Action, he or she still gets 1 Action.)"
            ]
        },
        {
            "number": "76",
            "name": "Care of Magical Creatures",
            "lesson": [
                "Care of Magical Creatures"
            ],
            "type": [
                "Lesson"
            ],
            "provides": [
                {
                    "lesson": "Care of Magical Creatures",
                    "amount": "1"
                }
            ],
            "rarity": "Lesson",
            "artist": [
                "Shanth Enjeti",
                "Melissa Ferreira"
            ]
        },
        {
            "number": "77",
            "name": "Charms",
            "lesson": [
                "Charms"
            ],
            "type": [
                "Lesson"
            ],
            "provides": [
                {
                    "lesson": "Charms",
                    "amount": "1"
                }
            ],
            "rarity": "Lesson",
            "artist": [
                "Shanth Enjeti",
                "Melissa Ferreira"
            ]
        },
        {
            "number": "78",
            "name": "Potions",
            "lesson": [
                "Potions"
            ],
            "type": [
                "Lesson"
            ],
            "provides": [
                {
                    "lesson": "Potions",
                    "amount": "1"
                }
            ],
            "rarity": "Lesson",
            "artist": [
                "Shanth Enjeti",
                "Melissa Ferreira"
            ]
        },
        {
            "number": "79",
            "name": "Quidditch",
            "lesson": [
                "Quidditch"
            ],
            "type": [
                "Lesson"
            ],
            "provides": [
                {
                    "lesson": "Quidditch",
                    "amount": "1"
                }
            ],
            "rarity": "Lesson",
            "artist": [
                "Shanth Enjeti",
                "Melissa Ferreira"
            ]
        },
        {
            "number": "80",
            "name": "Transfiguration",
            "lesson": [
                "Transfiguration"
            ],
            "type": [
                "Lesson"
            ],
            "provides": [
                {
                    "lesson": "Transfiguration",
                    "amount": "1"
                }
            ],
            "rarity": "Lesson",
            "artist": [
                "Shanth Enjeti",
                "Melissa Ferreira"
            ]
        }
    ]
}